spec/vcr/qbo_api/create/invoice.yml

---
http_interactions:
- request:
    method: post
    uri: https://sandbox-quickbooks.api.intuit.com/v3/invoice
    body:
      encoding: UTF-8
      string: '{"Line":[{"Amount":100.0,"DetailType":"SalesItemLineDetail","SalesItemLineDetail":{"ItemRef":{"value":"1","name":"Services"}}}],"CustomerRef":{"value":"1"}}'
    headers:
      Content-Type:
      - application/json;charset=UTF-8
      Accept:
      - application/json
      User-Agent:
      - Faraday v0.9.2
      Authorization:
      - OAuth oauth_consumer_key="<CONSUMER_KEY>", oauth_nonce="553ef842d6191f6706c9ac9f8b208319",
        oauth_signature="rFfxp2N%2FTC7QfIpWHgSWO4r%2FRBk%3D", oauth_signature_method="HMAC-SHA1",
        oauth_timestamp="1446731238", oauth_token="<ACCESS_TOKEN>", oauth_version="1.0"
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 05 Nov 2015 13:47:19 GMT
      Content-Type:
      - application/json;charset=UTF-8
      Intuit-Tid:
      - 76825f93-1054-421f-9fea-933213c571a5
      Via:
      - 1.1 ipp-gateway-.net
      Cache-Control:
      - max-age=0, no-cache, no-store, must-revalidate, private
      Expires:
      - '0'
      Qbo-Version:
      - '1510.283'
      Transfer-Encoding:
      - chunked
    body:
      encoding: ASCII-8BIT
      string: '{"Invoice":{"Deposit":0,"AllowIPNPayment":false,"AllowOnlinePayment":false,"AllowOnlineCreditCardPayment":false,"AllowOnlineACHPayment":false,"domain":"QBO","sparse":false,"Id":"145","SyncToken":"0","MetaData":{"CreateTime":"2015-11-05T05:47:19-08:00","LastUpdatedTime":"2015-11-05T05:47:19-08:00"},"CustomField":[{"DefinitionId":"1","Name":"Crew
        #","Type":"StringType"}],"DocNumber":"1038","TxnDate":"2015-11-05","CurrencyRef":{"value":"USD","name":"United
        States Dollar"},"LinkedTxn":[],"Line":[{"Id":"1","LineNum":1,"Amount":100.00,"DetailType":"SalesItemLineDetail","SalesItemLineDetail":{"ItemRef":{"value":"1","name":"Services"},"TaxCodeRef":{"value":"NON"}}},{"Amount":100.00,"DetailType":"SubTotalLineDetail","SubTotalLineDetail":{}}],"TxnTaxDetail":{"TotalTax":0},"CustomerRef":{"value":"1","name":"Amy''s
        Bird Sanctuary"},"BillAddr":{"Id":"2","Line1":"4581 Finch St.","City":"Bayshore","CountrySubDivisionCode":"CA","PostalCode":"94326","Lat":"INVALID","Long":"INVALID"},"ShipAddr":{"Id":"2","Line1":"4581
        Finch St.","City":"Bayshore","CountrySubDivisionCode":"CA","PostalCode":"94326","Lat":"INVALID","Long":"INVALID"},"DueDate":"2015-12-05","TotalAmt":100.00,"ApplyTaxAfterDiscount":false,"PrintStatus":"NeedToPrint","EmailStatus":"NotSet","Balance":100.00},"time":"2015-11-05T05:47:19.702-08:00"}'
    http_version: 
  recorded_at: Thu, 05 Nov 2015 13:47:20 GMT
recorded_with: VCR 2.9.3
